[
    {
        "job_title": "Social Media Manager (On-Site)",
        "company_name": "EurosHub",
        "required_skills": "Develop and implement creative social media strategies\nManage daily content planning, creation, and posting across Facebook, TikTok, Instagram, and LinkedIn\nMonitor brand engagement, respond to messages/comments, and foster active online communities\nAnalyze social media performance, track KPIs, and generate actionable reports\nCollaborate with the marketing and design teams\nStay current with social trends and algorithms"
    },
    {
        "job_title": "SEO Expert (On-Site)",
        "company_name": "EurosHub",
        "required_skills": "Develop and implement comprehensive SEO strategies\nOptimize website structure, content, and metadata\nManage and optimize Google Business Profiles\nConduct keyword research, competitor analysis, and content audits\nDiagnose and fix technical SEO issues\nCollaborate with design, content, and development teams\nMonitor and analyze performance using SEO tools\nStay up-to-date with Google algorithm updates"
    },
    {
        "job_title": "Business Development Executive",
        "company_name": "EurosHub",
        "required_skills": "Identify and connect with potential international clients\nConduct virtual meetings, communicate project details, negotiate terms, close deals\nPropose compelling proposals and presentations\nBuild and maintain long-term client relationships\nMeet and exceed monthly growth and revenue targets"
    },
    {
        "job_title": "IT Sales Enterprise",
        "company_name": "Kalsoft",
        "required_skills": "KalSoft is looking for an experienced Enterprise Sales Account Manager with strong knowledge of Microsoft technologies, ERP/Business Applications, and Automation platforms such as Nintex and Power Platform. The ideal candidate will have a proven track record in IT enterprise sales and the ability to drive revenue through strategic account development. Onsite opportunity for Dubai."
    },
    {
        "job_title": "IT Sales Enterprise",
        "company_name": "Kalsoft",
        "required_skills": "KalSoft is looking for an experienced Enterprise Sales Account Manager with strong knowledge of Microsoft technologies, ERP/Business Applications, and Automation platforms such as Nintex and Power Platform. The ideal candidate will have a proven track record in IT enterprise sales and the ability to drive revenue through strategic account development. Onsite opportunity for Kuwait."
    },
    {
        "job_title": "IT Sales Enterprise",
        "company_name": "Kalsoft",
        "required_skills": "Seeking a dynamic and visionary Vice President â\u0080\u0093 Sales to lead KalSoftâ\u0080\u0099s sales strategy, business development, and revenue growth across all regions. Proven expertise in enterprise sales within the Microsoft ecosystem, solution-based selling, channel management, and strategic partnerships."
    },
    {
        "job_title": "HR Manager",
        "company_name": "TechAbout",
        "required_skills": "Responsible for recruitment, employee engagement, and HR operations across TechAbout."
    },
    {
        "job_title": "Content Writer",
        "company_name": "TechAbout",
        "required_skills": "Create high-quality written content for blogs, social media, and marketing campaigns."
    },
    {
        "job_title": "WordPress Developer",
        "company_name": "TechAbout",
        "required_skills": "Develop and maintain WordPress websites, themes, and plugins."
    },
    {
        "job_title": "Graphic Designer",
        "company_name": "TechAbout",
        "required_skills": "Create visuals for digital marketing, branding, and campaigns."
    },
    {
        "job_title": "SEO Specialist",
        "company_name": "TechAbout",
        "required_skills": "Optimize website content and structure to improve search engine rankings."
    },
    {
        "job_title": "Laravel Developer",
        "company_name": "TechAbout",
        "required_skills": "Develop backend solutions using Laravel framework and PHP."
    },
    {
        "job_title": "Tech Journalist/Reporter",
        "company_name": "TechAbout",
        "required_skills": "Cover tech news, report on innovations, and create tech articles for online publication."
    },
    {
        "job_title": "Content Strategist",
        "company_name": "TechAbout",
        "required_skills": "Develop and execute content strategies for TechAboutâ\u0080\u0099s digital platforms."
    },
    {
        "job_title": "Content Director",
        "company_name": "TechAbout",
        "required_skills": "Oversee all content creation and strategy, managing the content team."
    },
    {
        "job_title": "Video Editor",
        "company_name": "TechAbout",
        "required_skills": "Edit and produce high-quality videos for marketing and social media."
    },
    {
        "job_title": "Social Media Manager",
        "company_name": "TechAbout",
        "required_skills": "Manage TechAboutâ\u0080\u0099s social media accounts, strategy, and campaigns."
    },
    {
        "job_title": "Web Developer",
        "company_name": "TechAbout",
        "required_skills": "Develop and maintain websites, ensuring functionality and user experience."
    },
    {
        "job_title": "Chief Accountant",
        "company_name": "trg",
        "required_skills": "Responsible for overseeing all accounting operations, financial reporting, and compliance as the primary accounting leader in a hybrid environment in Vietnam."
    },
    {
        "job_title": "Outbound Lead Specialist",
        "company_name": "trg",
        "required_skills": "Focus on generating new business leads through proactive outbound strategies and nurturing the sales pipeline in a hybrid role based in Vietnam."
    },
    {
        "job_title": "Technical Consultant",
        "company_name": "trg",
        "required_skills": "Provide expert technical guidance and support for implementing and optimizing solutions for clients, working in a hybrid capacity in Vietnam."
    },
    {
        "job_title": "Freelance Application Consultant (Thailand-based)",
        "company_name": "trg",
        "required_skills": "Offer specialized, project-based application consulting services to clients in Thailand, utilizing expertise on a freelance and hybrid basis."
    },
    {
        "job_title": "Application Consultant (with ERP or Financial Accounting software implementation experience)",
        "company_name": "trg",
        "required_skills": "Implement and configure complex applications, focusing on clients requiring ERP or Financial Accounting software solutions, based in Thailand with a hybrid arrangement."
    },
    {
        "job_title": "Technical Support Executive (Internal & External Support)",
        "company_name": "trg",
        "required_skills": "Deliver timely and effective technical assistance and troubleshooting for both internal staff and external clients, based full-time in Vietnam."
    },
    {
        "job_title": "Sales Support Intern",
        "company_name": "trg",
        "required_skills": "Assist the sales team with administrative tasks, lead generation, and proposal preparation in a hybrid intern role in Vietnam."
    },
    {
        "job_title": "Sales Executive",
        "company_name": "trg",
        "required_skills": "Drive sales growth by identifying new opportunities, managing the sales cycle, and achieving targets in a hybrid role based in Vietnam."
    },
    {
        "job_title": "Senior Technical Application Consultant",
        "company_name": "trg",
        "required_skills": "Act as a subject matter expert, leading complex application implementations and providing advanced technical solutions for clients in a hybrid role in Vietnam."
    },
    {
        "job_title": "Junior Webmaster Intern (With Potential for Full-Time Employment)",
        "company_name": "trg",
        "required_skills": "Support website maintenance, content updates, and digital asset management, learning critical webmaster skills in a hybrid intern role in Vietnam with potential for a full-time offer."
    },
    {
        "job_title": "Video Production Intern",
        "company_name": "trg",
        "required_skills": "Support the marketing team by planning, shooting, and editing video content for various platforms in a hybrid intern role in Vietnam."
    },
    {
        "job_title": "Account Manager (Hanoi-based)",
        "company_name": "trg",
        "required_skills": "Manage and grow client relationships from a remote location in Hanoi, focusing on strategic account development and long-term partnerships."
    },
    {
        "job_title": "Graphic Design Intern (for PJ's Coffee of TRG)",
        "company_name": "trg",
        "required_skills": "Design engaging visual content and marketing materials specifically for the PJ's Coffee brand, working as a hybrid intern in Vietnam."
    },
    {
        "job_title": "Business Development Intern",
        "company_name": "trg",
        "required_skills": "Assist in market research, strategic planning, and identifying new business opportunities across multiple locations in a hybrid intern role."
    },
    {
        "job_title": "Recruitment Intern",
        "company_name": "trg",
        "required_skills": "Support the HR/Talent Acquisition team with candidate sourcing, screening, scheduling, and administrative tasks in a hybrid intern role in Vietnam."
    },
    {
        "job_title": "WordPress Developer Internship",
        "company_name": "trg",
        "required_skills": "Develop and maintain corporate websites, focusing on WordPress platform management, theme customization, and plugin configuration as a hybrid intern in Vietnam."
    },
    {
        "job_title": "Account Manager (HCM-based)",
        "company_name": "trg",
        "required_skills": "Manage and expand client accounts in Ho Chi Minh City, focusing on sales targets, relationship building, and customer satisfaction in a hybrid role."
    },
    {
        "job_title": "Senior Account Manager (Thailand-based)",
        "company_name": "trg",
        "required_skills": "Manage high-value accounts and strategic partnerships in Thailand, driving significant revenue growth and working in a fully remote capacity."
    },
    {
        "job_title": "Sales Operation Intern",
        "company_name": "trg",
        "required_skills": "Support the sales team by managing data, optimizing processes, analyzing performance metrics, and handling administrative tasks in a hybrid intern role in Vietnam."
    },
    {
        "job_title": "SOP Intern",
        "company_name": "trg",
        "required_skills": "Document and standardize internal operational procedures (SOPs), helping to streamline business processes and improve efficiency in a hybrid intern role in Vietnam."
    },
    {
        "job_title": "Software Engineering",
        "company_name": "cubix_jobs",
        "required_skills": "Web, Mobile, SaaS, AI, and Emerging Tech Developers."
    },
    {
        "job_title": "Game Development & Design",
        "company_name": "cubix_jobs",
        "required_skills": "Game Designers, Artists, Animators."
    },
    {
        "job_title": "Creative & UI/UX",
        "company_name": "cubix_jobs",
        "required_skills": "Graphic Designers, UI/UX Experts, Motion Designers."
    },
    {
        "job_title": "DevOps & Infrastructure",
        "company_name": "cubix_jobs",
        "required_skills": "DevOps Engineers, Cloud Specialists, System Admins."
    },
    {
        "job_title": "QA & Testing",
        "company_name": "cubix_jobs",
        "required_skills": "Manual Testers, Automation Engineers, QA Analysts."
    },
    {
        "job_title": "Business & Leadership",
        "company_name": "cubix_jobs",
        "required_skills": "Project Managers, Product Owners, Business Development Leaders."
    },
    {
        "job_title": "Senior Backend Developer",
        "company_name": "Venture Dive",
        "required_skills": "Responsible for overseeing all accounting operations, ensuring financial reporting compliance with local (VAS) and international standards, managing tax filings, and acting as the main point of contact for audits in a hybrid environment."
    },
    {
        "job_title": "Digital Product Manager",
        "company_name": "JazzCash",
        "required_skills": "Focus on generating qualified sales leads through proactive outbound activities (e.g., cold calling, email campaigns) to nurture the sales pipeline and schedule discovery meetings for the sales team in Vietnam."
    },
    {
        "job_title": "Sales Executive (Enterprise Solutions)",
        "company_name": "Systems Limited",
        "required_skills": "Provide specialized technical consulting to clients, including system implementation, configuration, API integration, data migration, and troubleshooting, ensuring successful project delivery in Vietnam."
    },
    {
        "job_title": "Technical Support Specialist (Night Shift)",
        "company_name": "TRG Pakistan",
        "required_skills": "Engage in project-based consulting, primarily responsible for the pre-sales, implementation, configuration, and user training of enterprise application software (like ERP/Accounting systems) for clients in Thailand."
    },
    {
        "job_title": "Supply Chain Analyst",
        "company_name": "Airlift Technologies",
        "required_skills": "Lead the full lifecycle implementation of complex software applications, utilizing expertise in ERP or Financial Accounting systems, to meet client business requirements in Thailand."
    },
    {
        "job_title": "Social Media Content Creator",
        "company_name": "TPL Corp",
        "required_skills": "Deliver front-line technical support (Tier 1/2) for both internal staff and external clients, managing ticketing, troubleshooting software issues, and ensuring swift resolution to maintain business continuity in Vietnam."
    },
    {
        "job_title": "QA Engineer (Manual & Automation)",
        "company_name": "Contour Software",
        "required_skills": "Assist the sales team with administrative tasks, data management in the CRM system, generating reports, preparing proposals, and conducting market research to support lead qualification efforts in a hybrid intern role."
    },
    {
        "job_title": "Credit Risk Officer",
        "company_name": "HBL (Habib Bank Ltd)",
        "required_skills": "Drive revenue growth by identifying, qualifying, and closing new business opportunities, managing the entire sales cycle, and maintaining strong client relationships across Vietnam."
    },
    {
        "job_title": "Machine Learning Engineer",
        "company_name": "Netsol Technologies",
        "required_skills": "Act as a subject matter expert, leading complex application deployments, performing advanced technical configuration, system customization, and post-go-live optimization for major client projects in Vietnam."
    },
    {
        "job_title": "UI/UX Designer",
        "company_name": "KeepTruckin (Motive)",
        "required_skills": "Support the Marketing team by assisting with website maintenance, content management (CMS/WordPress), SEO tasks, and digital asset organization, with a clear path to a full-time Webmaster position upon successful completion."
    },
    {
        "job_title": "Graduate Trainee (Finance)",
        "company_name": "Telenor Pakistan",
        "required_skills": "Support the creation of engaging video content for marketing channels (social media, website, training), including filming, editing, graphic insertion, and production coordination in a hybrid intern role."
    },
    {
        "job_title": "E-commerce Campaign Specialist",
        "company_name": "Daraz",
        "required_skills": "Manage and grow a dedicated portfolio of client accounts, focusing on strategic relationship management, contract renewals, upselling, and achieving revenue targets, working remotely from Hanoi."
    },
    {
        "job_title": "Property Sales Manager",
        "company_name": "Zameen.com",
        "required_skills": "Design and create engaging visual content, including social media graphics, in-store promotional materials (POSM), and marketing collateral, specifically for the PJ's Coffee brand under TRG F&B."
    },
    {
        "job_title": "Mobile App Developer (Flutter/React Native)",
        "company_name": "Careem",
        "required_skills": "Assist the Business Development team with market research, identifying new geographic and vertical business opportunities, qualifying potential partners/leads, and contributing to strategic growth planning."
    },
    {
        "job_title": "Talent Acquisition Specialist",
        "company_name": "PTCL",
        "required_skills": "Support the Talent Acquisition/HR team by assisting with candidate sourcing, screening resumes, scheduling interviews, managing candidate communication, and improving recruitment processes in a hybrid intern role."
    },
    {
        "job_title": "Accounts Payable Executive",
        "company_name": "Nestlé Pakistan",
        "required_skills": "Assist in the development, maintenance, and optimization of WordPress-based corporate websites, focusing on front-end coding (HTML/CSS/JavaScript), theme customization, and plugin management."
    },
    {
        "job_title": "Field Operations Coordinator",
        "company_name": "Bykea",
        "required_skills": "Manage and grow a dedicated portfolio of client accounts in Ho Chi Minh City, focusing on strategic relationship management, contract renewals, upselling, and achieving revenue targets in a hybrid role."
    },
    {
        "job_title": "Business Analyst",
        "company_name": "Techlogix",
        "required_skills": "Manage high-value strategic accounts in the Thailand market, driving significant revenue through complex sales and renewal cycles, cultivating long-term executive relationships, and working fully remote."
    },
    {
        "job_title": "Branch Operations Manager",
        "company_name": "Allied Bank Ltd",
        "required_skills": "Assist the Sales Operations team with data governance, CRM maintenance, sales reporting and analytics, process documentation, and commission calculation support in a hybrid intern role."
    },
    {
        "job_title": "Software Development Intern",
        "company_name": "Arbisoft",
        "required_skills": "Assist various departments by documenting and standardizing internal procedures (Standard Operating Procedures - SOPs), identifying process gaps, and contributing to overall organizational efficiency and quality assurance."
    }
]